{
  "dataset": "interchain_foundation",
  "tables": [
    {
      "name": "cosmos_chains_registry",
      "description": "This table contains information about the Cosmos ecosystem blockchain networks, including their names, identifiers, and status. The data is sourced from various blockchain sources within the Cosmos ecosystem.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "chain_name",
          "description": "The name of the Cosmos blockchain network.",
          "type": "STRING",
          "mode": "NULLABLE"
        },
        {
          "name": "chain_id",
          "description": "A unique identifier for the Cosmos blockchain network.",
          "type": "STRING",
          "mode": "NULLABLE"
        },
        {
          "name": "status",
          "description": "The current status of the Cosmos blockchain network.",
          "type": "STRING",
          "mode": "NULLABLE"
        },
        {
          "name": "network_type",
          "description": "The type of network (e.g. public, private, testnet) for the Cosmos blockchain network.",
          "type": "STRING",
          "mode": "NULLABLE"
        },
        {
          "name": "bech32_prefix",
          "description": "The Bech32 prefix used by the Cosmos blockchain network for addressing.",
          "type": "STRING",
          "mode": "NULLABLE"
        },
        {
          "name": "github_repo",
          "description": "The GitHub repository URL for the Cosmos blockchain network.",
          "type": "STRING",
          "mode": "NULLABLE"
        },
        {
          "name": "last_refresh",
          "description": "The date and time when the data for the Cosmos blockchain network was last refreshed.",
          "type": "TIMESTAMP",
          "mode": "NULLABLE"
        },
        {
          "name": "ingestion_date",
          "description": "The date and time when the data for the Cosmos blockchain network was ingested.",
          "type": "TIMESTAMP",
          "mode": "NULLABLE"
        }
      ]
    },
    {
      "name": "cosmwasm_github_analysis",
      "description": "This table provides a GitHub analysis of CosmWasm smart contracts, offering insights into the performance and usage of these contracts on the Cosmos ecosystem. It covers various metrics such as repository activity and contract deployments.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "month",
          "description": "The month in which the GitHub repository was analyzed.",
          "type": "TIMESTAMP",
          "mode": "NULLABLE"
        },
        {
          "name": "owner",
          "description": "The owner of the GitHub repository.",
          "type": "STRING",
          "mode": "NULLABLE"
        },
        {
          "name": "repo_name",
          "description": "The name of the GitHub repository being analyzed.",
          "type": "STRING",
          "mode": "NULLABLE"
        },
        {
          "name": "file_path",
          "description": "The path to the CosmWasm contract file within the repository.",
          "type": "STRING",
          "mode": "NULLABLE"
        },
        {
          "name": "stars",
          "description": "The number of stars the GitHub repository has received.",
          "type": "INTEGER",
          "mode": "NULLABLE"
        },
        {
          "name": "watchers",
          "description": "The number of users watching the GitHub repository.",
          "type": "INTEGER",
          "mode": "NULLABLE"
        },
        {
          "name": "forks",
          "description": "The number of times the GitHub repository has been forked.",
          "type": "INTEGER",
          "mode": "NULLABLE"
        },
        {
          "name": "cosmwasm",
          "description": "The total number of CosmWasm contracts deployed from this repository.",
          "type": "STRING",
          "mode": "NULLABLE"
        }
      ]
    },
    {
      "name": "cosmwasm_penetration_analysis",
      "description": "Cosmos Ecosystem Penetration Analysis: This table provides an overview of the growth and adoption of CosmWasm smart contracts on the Cosmos blockchain ecosystem. It offers insights into the deployment and instantiation of CosmWasm contracts and their economic impact over time.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "The date in ISO format (YYYY-MM-DD) representing when the data was collected from the Cosmos blockchain.",
          "type": "TIMESTAMP"
        },
        {
          "name": "chain_id",
          "description": "The unique identifier of the Cosmos blockchain from which the data originates.",
          "type": "STRING"
        },
        {
          "name": "day_deployments",
          "description": "The number of new CosmWasm smart contracts deployed on the network on a given day.",
          "type": "INTEGER"
        },
        {
          "name": "day_instantiations",
          "description": "The number of new instances created from deployed CosmWasm smart contracts on a given day.",
          "type": "INTEGER"
        },
        {
          "name": "economic_impact",
          "description": "A measure of the economic activity generated by CosmWasm smart contracts on the network on a given day.",
          "type": "FLOAT"
        }
      ]
    },
    {
      "name": "cosmwasm_traffic_analysis",
      "description": "This table provides an analysis of CosmWasm smart contract traffic across the Cosmos ecosystem. It offers insights into the usage and performance of CosmWasm contracts on various chains.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "The date when the data was recorded in the format YYYY-MM- DD.",
          "type": "TIMESTAMP"
        },
        {
          "name": "chain_id",
          "description": "The unique identifier of the Cosmos chain where the CosmWasm smart contract was executed.",
          "type": "STRING"
        },
        {
          "name": "contract",
          "description": "The address of the CosmWasm smart contract that was executed.",
          "type": "STRING"
        },
        {
          "name": "n_txns",
          "description": "The total number of transactions executed by the CosmWasm smart contract.",
          "type": "INTEGER"
        },
        {
          "name": "n_calls",
          "description": "The total number of function calls made by the CosmWasm smart contract.",
          "type": "INTEGER"
        },
        {
          "name": "fee_amount",
          "description": "The total amount of fees paid for executing the CosmWasm smart contract transactions.",
          "type": "FLOAT"
        }
      ]
    },
    {
      "name": "cosmwasm_users_analysis",
      "description": "This table provides an analysis of users in the Cosmos ecosystem, analyzing their interactions with CosmWasm smart contracts. It offers insights into the activity of different users across various chains.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "The date when the event occurred, represented in a standard date format.",
          "type": "TIMESTAMP"
        },
        {
          "name": "chain_id",
          "description": "The ID of the blockchain where the event occurred, unique to each Cosmos chain.",
          "type": "STRING"
        },
        {
          "name": "sender",
          "description": "The address of the user who initiated the transaction, often representing the user in the analysis.",
          "type": "STRING"
        }
      ]
    }
  ]
}