{
  "dataset": "interchain_foundation",
  "tables": [
    {
      "name": "cosmos_chains_registry",
      "description": "This table provides a registry of Cosmos ecosystem blockchain chains, including their status and network type. The data is used to track and monitor the current state of various Cosmos-based blockchains.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "chain_name",
          "description": "The name of the blockchain chain.",
          "type": "STRING",
          "mode": "NULLABLE"
        },
        {
          "name": "chain_id",
          "description": "A unique identifier for the blockchain chain.",
          "type": "STRING",
          "mode": "NULLABLE"
        },
        {
          "name": "status",
          "description": "The current status of the blockchain chain, such as active or inactive.",
          "type": "STRING",
          "mode": "NULLABLE"
        },
        {
          "name": "network_type",
          "description": "The type of network used by the blockchain chain, such as Tendermint or Cosmos-SDK.",
          "type": "STRING",
          "mode": "NULLABLE"
        },
        {
          "name": "bech32_prefix",
          "description": "The Bech32 prefix used by the blockchain chain for addressing and transactions.",
          "type": "STRING",
          "mode": "NULLABLE"
        },
        {
          "name": "github_repo",
          "description": "The GitHub repository URL associated with the blockchain chain.",
          "type": "STRING",
          "mode": "NULLABLE"
        },
        {
          "name": "last_refresh",
          "description": "The date and time when the data was last updated or refreshed.",
          "type": "TIMESTAMP",
          "mode": "NULLABLE"
        },
        {
          "name": "ingestion_date",
          "description": "The date and time when the data was ingested into the database.",
          "type": "TIMESTAMP",
          "mode": "NULLABLE"
        }
      ]
    },
    {
      "name": "cosmwasm_github_analysis",
      "description": "This table provides an analysis of GitHub repositories that utilize CosmWasm smart contracts, offering insights into their performance and usage metrics.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "month",
          "description": "The month in which the repository was analyzed, represented as a number (1-12).",
          "type": "TIMESTAMP",
          "mode": "NULLABLE"
        },
        {
          "name": "owner",
          "description": "The GitHub username or organization that owns the repository.",
          "type": "STRING",
          "mode": "NULLABLE"
        },
        {
          "name": "repo_name",
          "description": "The name of the GitHub repository.",
          "type": "STRING",
          "mode": "NULLABLE"
        },
        {
          "name": "file_path",
          "description": "The path to the CosmWasm smart contract file within the repository.",
          "type": "STRING",
          "mode": "NULLABLE"
        },
        {
          "name": "stars",
          "description": "The number of stars the repository has received on GitHub.",
          "type": "INTEGER",
          "mode": "NULLABLE"
        },
        {
          "name": "watchers",
          "description": "The number of users watching the repository on GitHub.",
          "type": "INTEGER",
          "mode": "NULLABLE"
        },
        {
          "name": "forks",
          "description": "The number of times the repository has been forked on GitHub.",
          "type": "INTEGER",
          "mode": "NULLABLE"
        },
        {
          "name": "cosmwasm",
          "description": "The presence or absence of a CosmWasm smart contract in the repository (True/False value).",
          "type": "STRING",
          "mode": "NULLABLE"
        }
      ]
    },
    {
      "name": "cosmwasm_penetration_analysis",
      "description": "This table provides a cosmwasm penetration analysis, offering insights into the deployment and instantiation activity across the Cosmos ecosystem. It offers a daily snapshot of economic impact and growth within the ecosystem.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "The date when the data was recorded. It represents a specific day in the Cosmos blockchain timeline.",
          "type": "TIMESTAMP"
        },
        {
          "name": "chain_id",
          "description": "A unique identifier for the Cosmos blockchain chain, used to differentiate between various chains in the ecosystem.",
          "type": "STRING"
        },
        {
          "name": "day_deployments",
          "description": "The total number of cosmwasm deployments that occurred on a specific day. This metric helps track the activity level of developers and the adoption rate of cosmwasm within the ecosystem.",
          "type": "INTEGER"
        },
        {
          "name": "day_instantiations",
          "description": "The total number of cosmwasm instantiations that occurred on a specific day. This metric provides insights into the utilization and growth of cosmwasm-based applications within the ecosystem.",
          "type": "INTEGER"
        },
        {
          "name": "economic_impact",
          "description": "A metric representing the economic impact of cosmwasm activity on a specific day. This could include revenue generated, tokens transferred, or other relevant economic indicators.",
          "type": "FLOAT"
        }
      ]
    },
    {
      "name": "cosmwasm_traffic_analysis",
      "description": "This table provides a high-level overview of CosmWasm smart contract traffic on the Cosmos blockchain network. It offers insights into the number of transactions, function calls, and fees associated with these contracts.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "Timestamp for when the data was recorded, in ISO 8601 format",
          "type": "TIMESTAMP"
        },
        {
          "name": "chain_id",
          "description": "Unique identifier for the Cosmos blockchain network",
          "type": "STRING"
        },
        {
          "name": "contract",
          "description": "Address of the CosmWasm smart contract",
          "type": "STRING"
        },
        {
          "name": "n_txns",
          "description": "Total number of transactions involving the CosmWasm smart contract",
          "type": "INTEGER"
        },
        {
          "name": "n_calls",
          "description": "Total number of function calls made by the CosmWasm smart contract",
          "type": "INTEGER"
        },
        {
          "name": "fee_amount",
          "description": "Total fee amount incurred by the CosmWasm smart contract",
          "type": "FLOAT"
        }
      ]
    },
    {
      "name": "cosmwasm_users_analysis",
      "description": "This table provides an analysis of user behavior on the Cosmos blockchain, specifically focusing on CosmWasm smart contracts. It offers insights into user activity, helping to understand the ecosystem's growth and adoption.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "The date of the transaction, represented in a standardized format (YYYY-MM-DD).",
          "type": "TIMESTAMP"
        },
        {
          "name": "chain_id",
          "description": "The unique identifier of the Cosmos blockchain where the transaction occurred.",
          "type": "STRING"
        },
        {
          "name": "sender",
          "description": "The address of the user who initiated the transaction.",
          "type": "STRING"
        }
      ]
    }
  ]
}