{
  "dataset": "lenses",
  "tables": [
    {
      "name": "lenses_cosmoshub_apr",
      "description": "This table provides a snapshot of the annual percentage rates (APRs) for various assets in the Cosmos ecosystem, offering insights into their growth and performance. By analyzing these APRs, users can make informed decisions about their investments and portfolio management.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "labels",
          "description": "A list of asset labels or names, categorizing the different assets within the Cosmos ecosystem.",
          "type": "TIMESTAMP"
        },
        {
          "name": "symbol",
          "description": "The unique symbol or identifier for each asset, facilitating easy identification and comparison.",
          "type": "STRING"
        },
        {
          "name": "mean_apr_1d_rolling",
          "description": "The daily rolling average of the annual percentage rate for each asset over the past 1 day, providing a short-term perspective on their performance.",
          "type": "FLOAT"
        },
        {
          "name": "mean_apr_7d_rolling",
          "description": "The daily rolling average of the annual percentage rate for each asset over the past 7 days, offering a medium-term perspective on their growth.",
          "type": "FLOAT"
        },
        {
          "name": "mean_apr_30d_rolling",
          "description": "The daily rolling average of the annual percentage rate for each asset over the past 30 days, providing a long-term perspective on their performance and stability.",
          "type": "FLOAT"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_atom_price",
      "description": "Cosmos Hub Atom price data provides historical exchange rates of Cosmos' native token, Atom, against the USDC stablecoin within the Cosmos ecosystem. This data is useful for analyzing cryptocurrency markets and making informed investment decisions.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_minutes",
          "description": "Time in minutes since the Cosmos Hub block was created",
          "type": "TIMESTAMP"
        },
        {
          "name": "asset",
          "description": "Name of the Cosmos ecosystem asset (in this case, the native Atom token)",
          "type": "STRING"
        },
        {
          "name": "price_in_usdc",
          "description": "Exchange price of the asset against USDC at the time of the block",
          "type": "FLOAT"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when the price data was ingested into the data system",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_chain_daily_revenue",
      "description": "This table provides a daily overview of revenue for the Cosmos Hub ecosystem, including transaction fees, Liquid Staking Derivative (LSD) fees, and Inter- Chain Secure (ICS) fees. The data is aggregated from various blockchains within the Cosmos ecosystem.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "Date in YYYY-MM-DD format representing the day for which the revenue data is reported.",
          "type": "DATE"
        },
        {
          "name": "chain_id",
          "description": "Unique identifier for the Cosmos blockchain network, used to distinguish between different chains in the ecosystem.",
          "type": "STRING"
        },
        {
          "name": "txn_fees",
          "description": "Total transaction fees collected from the Cosmos blockchain network for the reported day.",
          "type": "FLOAT"
        },
        {
          "name": "lsd_fees",
          "description": "Total fees collected from Liquid Staking Derivatives (LSD) operations on the Cosmos blockchain network for the reported day.",
          "type": "FLOAT"
        },
        {
          "name": "ics_fees",
          "description": "Total fees collected from Inter-Chain Secure (ICS) operations on the Cosmos blockchain network for the reported day.",
          "type": "FLOAT"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_chain_hourly_revenue",
      "description": "This table provides hourly revenue data from the Cosmos ecosystem, offering insights into the financial performance of the blockchain network. It captures fees generated from transactions and token-related activities.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "Date in which the hourly revenue was recorded",
          "type": "DATE"
        },
        {
          "name": "chain_id",
          "description": "Identifier of the Cosmos chain where the transactions occurred",
          "type": "STRING"
        },
        {
          "name": "txn_fees",
          "description": "Total fees collected from transaction-related activities",
          "type": "FLOAT"
        },
        {
          "name": "lsd_fees",
          "description": "Fees collected from Liquid Staking Derivative (LSD) activities",
          "type": "FLOAT"
        },
        {
          "name": "ics_fees",
          "description": "Fees collected from Inter-Chain Security (ICS) activities",
          "type": "FLOAT"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_ibc_flow",
      "description": "This table provides information on IBC flows between Cosmos Hub chains. It captures data on the frequency and duration of these flows, as well as the hub chains involved.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "The date on which the IBC flow occurred.",
          "type": "TIMESTAMP"
        },
        {
          "name": "stride",
          "description": "The stride of the IBC flow, representing the time interval between two consecutive flows.",
          "type": "FLOAT"
        },
        {
          "name": "persistence",
          "description": "The persistence of the IBC flow, indicating how long the flow has been active.",
          "type": "BIGNUMERIC"
        },
        {
          "name": "cosmoshub",
          "description": "The Cosmos Hub chain involved in the IBC flow.",
          "type": "FLOAT"
        },
        {
          "name": "ingestion_timestamp",
          "description": "The timestamp when the IBC flow data was ingested into the database.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_liquid_staking",
      "description": "This table tracks the Cosmos Hub liquid staking data, providing insights into the performance and persistence of staking rewards. The data is sourced from the Cosmos ecosystem blockchains, offering a comprehensive view of the liquid staking landscape.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "Date of data collection, representing the timestamp when the staking rewards were calculated.",
          "type": "TIMESTAMP"
        },
        {
          "name": "stride",
          "description": "Stride is a measure of the staking rewards persistence, indicating the consistency of returns over time.",
          "type": "FLOAT"
        },
        {
          "name": "persistence",
          "description": "Persistence is a measure of how consistent the staking rewards are over time, calculated as a percentage.",
          "type": "BIGNUMERIC"
        },
        {
          "name": "cosmoshub",
          "description": "The Cosmos Hub token balance, reflecting the accumulated staking rewards.",
          "type": "FLOAT"
        },
        {
          "name": "ingestion_timestamp",
          "description": "The timestamp when the data was ingested into the system, marking the time of data processing.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_liquid_staking_flow",
      "description": "This table provides an overview of the liquid staking flow on Cosmos hubs, showcasing key metrics to understand the movement of assets within the ecosystem. It highlights the total and top inflows and outflows, along with relevant transaction IDs.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "Time in hours since the last block was processed, indicating the freshness of the data.",
          "type": "TIMESTAMP"
        },
        {
          "name": "total_inflow",
          "description": "Total amount of assets flowing into the liquid staking pool within the specified time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow",
          "description": "The largest single inflow of assets into the liquid staking pool within the specified time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "Transaction ID associated with the top inflow of assets into the liquid staking pool.",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "Total amount of assets flowing out of the liquid staking pool within the specified time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow",
          "description": "The largest single outflow of assets from the liquid staking pool within the specified time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "Transaction ID associated with the top outflow of assets from the liquid staking pool.",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when the data was ingested into the system, indicating when the data became available.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_staking_flow",
      "description": "This table provides an overview of the staking flow for the Cosmos Hub network, offering insights into the hour-by-hour activity of tokens being transferred, staked, and unstaked.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "The hour at which the staking flow data was recorded, measured in Unix time.",
          "type": "TIMESTAMP"
        },
        {
          "name": "total_inflow",
          "description": "The total amount of tokens flowing into the network during the given hour.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow",
          "description": "The largest amount of tokens flowing into the network during the given hour.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "The transaction ID of the transaction that contributed to the top inflow during the given hour.",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "The total amount of tokens flowing out of the network during the given hour.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow",
          "description": "The largest amount of tokens flowing out of the network during the given hour.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "The transaction ID of the transaction that contributed to the top outflow during the given hour.",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "The timestamp at which the staking flow data was ingested into the database, measured in Unix time.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_bonded_liquidity_flow",
      "description": "This table provides information on the flow of bonded liquidity in the Osmosis network, offering insights into the inflow and outflow of liquidity across various time periods.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "The time duration in hours, representing the time period over which the liquidity flow was observed.",
          "type": "TIMESTAMP"
        },
        {
          "name": "total_inflow",
          "description": "The total amount of liquidity that has flowed into the Osmosis network during the specified time period.",
          "type": "BIGNUMERIC"
        },
        {
          "name": "top_inflow",
          "description": "The maximum amount of liquidity that has flowed into the Osmosis network during the specified time period.",
          "type": "BIGNUMERIC"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "The transaction ID associated with the top inflow of liquidity during the specified time period.",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "The total amount of liquidity that has flowed out of the Osmosis network during the specified time period.",
          "type": "BIGNUMERIC"
        },
        {
          "name": "top_outflow",
          "description": "The maximum amount of liquidity that has flowed out of the Osmosis network during the specified time period.",
          "type": "BIGNUMERIC"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "The transaction ID associated with the top outflow of liquidity during the specified time period.",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "The timestamp when the data was ingested into the system, representing the time at which the data was last updated.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_chain_hourly_revenue",
      "description": "This table provides a detailed breakdown of hourly revenue generated from various transactions within the Cosmos ecosystem. It offers insights into the fee structures of the different blockchain components, highlighting the revenue streams of the network.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "The time in hours since the beginning of the data collection, used to track the hourly revenue over time",
          "type": "TIMESTAMP"
        },
        {
          "name": "tx_fees",
          "description": "Transaction fees collected from various blockchain operations, such as token transfers and smart contract executions",
          "type": "FLOAT"
        },
        {
          "name": "protorev",
          "description": "Protocol revenue generated from the Cosmos Hub's consensus mechanism, such as staking and validation",
          "type": "FLOAT"
        },
        {
          "name": "swap_fees",
          "description": "Fees collected from liquidity provision and trading on Cosmos- based decentralized exchanges (DEXs)",
          "type": "FLOAT"
        },
        {
          "name": "taker_fees",
          "description": "Fees collected from market makers and liquidity providers on Cosmos-based DEXs",
          "type": "FLOAT"
        },
        {
          "name": "ingestion_timestamp",
          "description": "The timestamp when the data was ingested into the database, used for data synchronization and validation",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_concentration_of_activity",
      "description": "This table provides an overview of the concentration of activity on the Osmosis blockchain, showcasing trends and patterns in user engagement and network participation. By analyzing this data, users can gain insights into the growth and development of the Osmosis ecosystem.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "day",
          "description": "The date in which the activity concentration was measured, represented as a Unix timestamp.",
          "type": "TIMESTAMP"
        },
        {
          "name": "COA",
          "description": "The concentration of activity on the Osmosis blockchain, measured as a ratio of active addresses to total addresses and representing the level of network participation and engagement.",
          "type": "FLOAT"
        }
      ]
    },
    {
      "name": "lenses_osmosis_daily_active_users",
      "description": "This table contains daily active users data from the Osmosis blockchain, providing insights into the network's usage and activity over time. It captures the users who interacted with the blockchain on a daily basis, contributing to the ecosystem's growth and development.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "block_timestamp",
          "description": "The timestamp when the block was created, representing the date and time when the transaction occurred.",
          "type": "TIMESTAMP"
        },
        {
          "name": "sender",
          "description": "The address of the user who sent a transaction, indicating their participation in the blockchain network on the specified day.",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "The timestamp when the block was ingested into the dataset, reflecting the time at which the data was processed and stored.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_daily_active_users_count",
      "description": "Daily active users count in the Cosmos ecosystem, providing insights into the growing adoption and user base of blockchain-based applications.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "day",
          "description": "Date of data collection in YYYY-MM-DD format, representing the daily snapshot of active users.",
          "type": "TIMESTAMP"
        },
        {
          "name": "unique_users",
          "description": "Total count of unique users actively engaging with blockchain- based applications within the Cosmos ecosystem on a given day.",
          "type": "INTEGER"
        }
      ]
    },
    {
      "name": "lenses_osmosis_ibc_flow",
      "description": "This table contains information about IBC (Inter-Blockchain Communication) flows on the Osmosis blockchain, providing insights into token transfers between different chains within the Cosmos ecosystem. It helps in understanding the flow of assets across the ecosystem.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "Time elapsed since the last block in hours, indicating the freshness of the data.",
          "type": "TIMESTAMP"
        },
        {
          "name": "chain_id",
          "description": "Unique identifier for the blockchain where the IBC flow occurred, providing context for the flow of assets.",
          "type": "STRING"
        },
        {
          "name": "total_inflow",
          "description": "Total amount of assets received by the chain through IBC flows, indicating the net inflow of assets.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow",
          "description": "The largest inflow of assets to the chain, providing insight into the most significant IBC flows.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "Transaction ID of the top inflow, allowing for further analysis or investigation of the flow.",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "Total amount of assets sent from the chain through IBC flows, indicating the net outflow of assets.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow",
          "description": "The largest outflow of assets from the chain, providing insight into the most significant IBC flows.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "Transaction ID of the top outflow, allowing for further analysis or investigation of the flow.",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when the data was ingested into the database, indicating the freshness and availability of the data.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_liquidity_flow",
      "description": "This table provides an overview of liquidity flow in the Osmosis ecosystem, tracking the movement of assets across different pools and wallets over time. It offers insights into the total inflow and outflow of assets, as well as the top transactions contributing to these flows.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "Timestamp of the data point in hours since the start of the Osmosis blockchain",
          "type": "TIMESTAMP"
        },
        {
          "name": "total_inflow",
          "description": "Total amount of assets flowing into the Osmosis ecosystem during this time period",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow",
          "description": "Top asset flowing into the Osmosis ecosystem during this time period",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "Transaction ID of the top inflow transaction",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "Total amount of assets flowing out of the Osmosis ecosystem during this time period",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow",
          "description": "Top asset flowing out of the Osmosis ecosystem during this time period",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "Transaction ID of the top outflow transaction",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when the data was ingested into the dataset, in UTC",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_new_users_ratio",
      "description": "This table provides insights into the growth and retention of users in the Cosmos ecosystem, showcasing the dynamics of new and returning users over time.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "new_users",
          "description": "The number of new users added to the network within a specific time period.",
          "type": "INTEGER"
        },
        {
          "name": "returning_users",
          "description": "The number of users who have previously interacted with the network and return within a specific time period.",
          "type": "INTEGER"
        },
        {
          "name": "new_users_ratio",
          "description": "A ratio representing the percentage of new users compared to the total number of users within a specific time period.",
          "type": "FLOAT"
        },
        {
          "name": "day",
          "description": "A timestamp indicating the date and time at which the user data was recorded.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_osmo_price",
      "description": "This table contains historical price data of various cryptocurrencies from the Cosmos ecosystem. The data is sourced from blockchain transactions and provides insights into market trends.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_minutes",
          "description": "Timestamp of the price data in minutes since the epoch (January 1, 1970).",
          "type": "TIMESTAMP"
        },
        {
          "name": "asset",
          "description": "Symbol of the cryptocurrency (e.g. ATOM, OSMO, etc.)",
          "type": "STRING"
        },
        {
          "name": "price_in_usdc",
          "description": "Current market price of the cryptocurrency in USDC (US Dollar Coin)",
          "type": "FLOAT"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when the data was ingested from the blockchain into the database",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_osmo_top_stakeholders",
      "description": "This table provides an overview of the top stakeholders in the Osmosis network. It highlights the addresses with the largest staked amounts, their staked, bonded, and liquid amounts.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "Date of snapshot when the staked amounts were recorded.",
          "type": "STRING"
        },
        {
          "name": "address",
          "description": "The address of the Osmosis validator or delegate.",
          "type": "STRING"
        },
        {
          "name": "staked_amount",
          "description": "The total staked amount held by the validator or delegate.",
          "type": "FLOAT"
        },
        {
          "name": "bonded_amount",
          "description": "The amount of tokens bonded by the validator or delegate, which are eligible for voting.",
          "type": "FLOAT"
        },
        {
          "name": "liquid_amount",
          "description": "The amount of tokens that are not bonded and can be withdrawn or used for other purposes.",
          "type": "FLOAT"
        }
      ]
    },
    {
      "name": "lenses_osmosis_returning_users_ratio",
      "description": "This table provides an overview of the ratio of returning users in the Osmosis ecosystem, giving insight into user retention and engagement. The data is based on blockchain transactions and provides a snapshot of user behavior over time.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "new_users_ratio",
          "description": "The ratio of new users to the total number of users in a given period, indicating the rate of user acquisition.",
          "type": "FLOAT"
        },
        {
          "name": "day",
          "description": "The day of the observation period, allowing for analysis of trends and patterns over time.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_staking_flow",
      "description": "This table provides an overview of the staking flow on Osmosis, a decentralized exchange and liquidity protocol within the Cosmos ecosystem, showcasing the total and top inflows and outflows of tokens over time.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "The time elapsed since the last ingestion in hours.",
          "type": "TIMESTAMP"
        },
        {
          "name": "total_inflow",
          "description": "The total amount of tokens flowing into the Osmosis staking pool over the specified time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow",
          "description": "The largest single inflow of tokens into the Osmosis staking pool over the specified time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "The transaction ID of the top inflow transaction.",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "The total amount of tokens flowing out of the Osmosis staking pool over the specified time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow",
          "description": "The largest single outflow of tokens from the Osmosis staking pool over the specified time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "The transaction ID of the top outflow transaction.",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "The timestamp of the last data ingestion.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_superfluid_staking_flow",
      "description": "This table provides an overview of the superfluid staking flow on Osmosis, showcasing the total inflow and outflow of tokens, as well as the top inflows and outflows, over time. The data is sourced from the Cosmos blockchain ecosystem.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "Time elapsed since the beginning of the superfluid staking flow, measured in hours.",
          "type": "TIMESTAMP"
        },
        {
          "name": "total_inflow",
          "description": "Total amount of tokens flowing into the superfluid staking pool over the specified time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow",
          "description": "Largest single transaction inflowing into the superfluid staking pool over the specified time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "Transaction ID of the largest single transaction inflowing into the superfluid staking pool over the specified time period.",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "Total amount of tokens flowing out of the superfluid staking pool over the specified time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow",
          "description": "Largest single transaction outflowing from the superfluid staking pool over the specified time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "Transaction ID of the largest single transaction outflowing from the superfluid staking pool over the specified time period.",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when the data was ingested into the system, indicating the freshness of the data.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_trading_flow",
      "description": "This table provides a detailed view of the trading activities on the Osmosis blockchain, capturing key metrics such as transaction volume and maximum volume in USD. The data allows for analysis of liquidity and trading patterns on the Osmosis network.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "The time of the trading activity in hours, measured from the start of the network",
          "type": "TIMESTAMP"
        },
        {
          "name": "pool_id",
          "description": "A unique identifier for the pool involved in the trading activity",
          "type": "STRING"
        },
        {
          "name": "volume_in_usd",
          "description": "The total volume of the trading activity in USD",
          "type": "FLOAT"
        },
        {
          "name": "tx_id",
          "description": "The unique transaction ID associated with the trading activity",
          "type": "STRING"
        },
        {
          "name": "max_volume_in_usd",
          "description": "The maximum volume of the trading activity in USD",
          "type": "FLOAT"
        }
      ]
    }
  ]
}