{
  "dataset": "lenses",
  "tables": [
    {
      "name": "lenses_cosmoshub_apr",
      "description": "This table provides APR data for assets on the Cosmos blockchain, offering insights into the rewarding activities and rates within the Cosmos network. APR (Annual Percentage Rate) is calculated based on the rolling averages of the past day, week, and month.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "labels",
          "description": "Unique identifiers for project labels and categorizations",
          "type": "TIMESTAMP"
        },
        {
          "name": "symbol",
          "description": "Token symbols associated with specific blockchain assets",
          "type": "STRING"
        },
        {
          "name": "mean_apr_1d_rolling",
          "description": "Seven-day Simple Moving Average of daily Average Rate of Return",
          "type": "FLOAT"
        },
        {
          "name": "mean_apr_7d_rolling",
          "description": "Thirty-day Simple Moving Average of weekly Average Rate of Return",
          "type": "FLOAT"
        },
        {
          "name": "mean_apr_30d_rolling",
          "description": "Simple Moving Average of monthly Average Rate of Return",
          "type": "FLOAT"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_atom_price",
      "description": "This table contains the current and historical prices of assets within the Cosmos ecosystem. It provides a detailed view of the price fluctuations of these assets over time, allowing users to analyze market trends and patterns.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_minutes",
          "description": "Time elapsed since block proposal, in minutes.",
          "type": "TIMESTAMP"
        },
        {
          "name": "asset",
          "description": "Token or asset (e.g., ATOM, OSMO) being traded or used.",
          "type": "STRING"
        },
        {
          "name": "price_in_usdc",
          "description": "Current price of asset in USD coin (USDC) per unit.",
          "type": "FLOAT"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when data was ingested or recorded.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_chain_daily_revenue",
      "description": "This dataset tracks daily revenue from various chains within the Cosmos ecosystem, providing insights into the network's overall financial performance. The daily revenue is calculated from transaction fees and ICS fees.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "Timestamp of each daily snapshot of blockchain chain performance",
          "type": "DATE"
        },
        {
          "name": "chain_id",
          "description": "Unique identifier for each Cosmos blockchain network instance",
          "type": "STRING"
        },
        {
          "name": "txn_fees",
          "description": "Total fees collected from all transactions within each chain daily",
          "type": "FLOAT"
        },
        {
          "name": "lsd_fees",
          "description": "Total fees collected from Liquidity Staking Deposits (LSD) on each chain daily",
          "type": "FLOAT"
        },
        {
          "name": "ics_fees",
          "description": "Total fees collected from ICS (Inter-Chain Secure) protocol interactions daily",
          "type": "FLOAT"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_chain_hourly_revenue",
      "description": "The cosmoshub_chain_hourly_revenue table provides data on the total revenue generated by Cosmos blockchain transactions on an hourly basis, including transaction fees, liquidity staking derivatives (LSD) fees, and Inter-Chain Service (ICS) fees. This data offers insights into the economic activity within the Cosmos ecosystem.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "Date of snapshot, typically in ISO 8601 format, representing a specific block time",
          "type": "DATE"
        },
        {
          "name": "chain_id",
          "description": "Unique identifier for the Cosmos blockchain network (e.g., Cosmos Hub, Osmosis)",
          "type": "STRING"
        },
        {
          "name": "txn_fees",
          "description": "Total fees collected for transaction processing within the chain, aggregated hourly",
          "type": "FLOAT"
        },
        {
          "name": "lsd_fees",
          "description": "Fees associated with transactions processed using LCD (Liquid Staking Derivative) protocol",
          "type": "FLOAT"
        },
        {
          "name": "ics_fees",
          "description": "Fees associated with Inter-Blockchain Communication (IBC) transactions within the chain",
          "type": "FLOAT"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_ibc_flow",
      "description": "This table provides insights into IBC flows, which enable the transfer of assets between Cosmos-based blockchains. It captures the key metrics related to these flows.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "Timestamp of the event occurrence in blockchain network",
          "type": "TIMESTAMP"
        },
        {
          "name": "stride",
          "description": "Elapsed time interval between events in a specific blockchain context",
          "type": "FLOAT"
        },
        {
          "name": "persistence",
          "description": "Indication of transaction finality or commitment in blockchain",
          "type": "BIGNUMERIC"
        },
        {
          "name": "cosmoshub",
          "description": "Identifier of the Cosmos Hub or related blockchain network",
          "type": "FLOAT"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Time when the event data was ingested or processed",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_liquid_staking",
      "description": "This table provides an overview of liquid staking data from the Cosmos ecosystem, offering insights into the distribution and dynamics of staked tokens across various Cosmos hubs.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "The date on which the liquid staking data was recorded.",
          "type": "TIMESTAMP"
        },
        {
          "name": "stride",
          "description": "Represents the progress or measure of staking activity over time, providing insights into the growth and maintenance of liquidity in the Cosmos ecosystem.",
          "type": "FLOAT"
        },
        {
          "name": "persistence",
          "description": "Indicates the level of commitment from validators to participate in liquid staking, reflecting their willingness to maintain their positions in the network.",
          "type": "BIGNUMERIC"
        },
        {
          "name": "cosmoshub",
          "description": "Represents a specific hub within the Cosmos network, providing a focal point for liquid staking activities and enabling users to target specific nodes for participation.",
          "type": "FLOAT"
        },
        {
          "name": "ingestion_timestamp",
          "description": "The timestamp when the data was ingested into the system, reflecting the most recent point at which the data was processed and updated.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_liquid_staking_flow",
      "description": "This table provides an overview of the liquid staking flow for the Cosmos Hub network, helping users understand the dynamics of asset distribution and movement within the ecosystem. It offers insights into total and top inflows, outflows, and corresponding transactions.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "Elapsed time since last data ingestion in hours",
          "type": "TIMESTAMP"
        },
        {
          "name": "total_inflow",
          "description": "Cumulative Blockchain native token value received by the validator",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow",
          "description": "Highest single inflow value as native blockchain token",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "Transaction ID that delivered the top inflow to the validator",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "Cumulative Blockchain native token value sent by the validator",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow",
          "description": "Highest single outflow value as native blockchain token",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "Transaction ID that processed the top outflow from the validator",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Unix timestamp when the data was ingested into the dataset",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_staking_flow",
      "description": "This table provides a high-level overview of the Cosmos Ecosystem's staking flow, including total and top inflows and outflows. Staking flow is essential for the operation and maintenance of the Cosmos Hub.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "Elasped time between staking flow records in hours",
          "type": "TIMESTAMP"
        },
        {
          "name": "total_inflow",
          "description": "Total value received by validators via Cosmos staking",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow",
          "description": "Highest staking inflow received by a validator",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "Transaction ID of the top staking inflow transaction",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "Total value withdrawn by validators via Cosmos staking",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow",
          "description": "Highest staking outflow made by a validator",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "Transaction ID of the top staking outflow transaction",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when data was ingested from the Cosmos blockchain network",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_bonded_liquidity_flow",
      "description": "This table provides information on the flow of bonded liquidity in the Osmosis network, offering insights into the inflow and outflow of liquidity across various time periods.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "Elapsed time in hours since the bonded liquidity flow began",
          "type": "TIMESTAMP"
        },
        {
          "name": "total_inflow",
          "description": "Cumulative in-flow value of liquidity from bonded pool participants",
          "type": "BIGNUMERIC"
        },
        {
          "name": "top_inflow",
          "description": "Maximum in-flow value of a single bonded liquidity participant",
          "type": "BIGNUMERIC"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "Hash of the transaction causing the maximum in-flow",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "Cumulative out-flow value of liquidity from bonded pool participants",
          "type": "BIGNUMERIC"
        },
        {
          "name": "top_outflow",
          "description": "Maximum out-flow value of a single bonded liquidity participant",
          "type": "BIGNUMERIC"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "Hash of the transaction causing the maximum out-flow",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when the data was ingested into the database",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_chain_hourly_revenue",
      "description": "This table provides an hourly breakdown of the revenue generated by the Osmosis blockchain, highlighting its transactional dynamics and fee collection patterns. The data offers valuable insights into the chain's revenue streams across various categories.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "Amount of time elapsed in hours at the time of data collection.",
          "type": "TIMESTAMP"
        },
        {
          "name": "tx_fees",
          "description": "Total fees collected from executed transactions in the Osmosis chain.",
          "type": "FLOAT"
        },
        {
          "name": "protorev",
          "description": "Cumulative PROTO rewards issued on the Osmosis chain per hour.",
          "type": "FLOAT"
        },
        {
          "name": "swap_fees",
          "description": "Fees generated from on-chain swap transactions on the Osmosis chain.",
          "type": "FLOAT"
        },
        {
          "name": "taker_fees",
          "description": "Fees earned by takers from on-chain interaction on the Osmosis chain.",
          "type": "FLOAT"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when the data is ingested into the system from the blockchain.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_concentration_of_activity",
      "description": "This stream represents the Concentration of Activity (COA) of Osmosis on the Cosmos blockchain ecosystem. It measures the distribution of activity across the network, providing insights into the market dynamics and executing talent.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "day",
          "description": "Date of data processing within the context of blockchain networks",
          "type": "TIMESTAMP"
        },
        {
          "name": "COA",
          "description": "Concentration of activity, quantifying overall network engagement metrics",
          "type": "FLOAT"
        }
      ]
    },
    {
      "name": "lenses_osmosis_daily_active_users",
      "description": "Daily active users in the Osmosis network. This table contains information about the daily activities of users on the Osmosis blockchain, from blockchains of the cosmos ecosystem. ",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "block_timestamp",
          "description": "Timestamp of the block when the transaction was processed on the blockchain",
          "type": "TIMESTAMP"
        },
        {
          "name": "sender",
          "description": "Public address of the sender initiating the transaction or event",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when the data is ingested into the blockchain analytics system",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_daily_active_users_count",
      "description": "Daily count of unique active users in the Osmosis network, providing insight into the ecosystem's growth and activity levels. This data is specific to the Cosmos ecosystem, giving a glimpse into the adoption and usage patterns of Osmosis.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "day",
          "description": "Date of daily active users count measurement on Osmosis network",
          "type": "TIMESTAMP"
        },
        {
          "name": "unique_users",
          "description": "Count of distinct users actively using Osmosis on a daily basis",
          "type": "INTEGER"
        }
      ]
    },
    {
      "name": "lenses_osmosis_ibc_flow",
      "description": "This table tracks IBC (Inter- Blockchain Communication) flows in the Osmosis ecosystem, providing insights into token movement between different chains.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "Timestamp in hours since block validation occurrence",
          "type": "TIMESTAMP"
        },
        {
          "name": "chain_id",
          "description": "Unique identifier of a Cosmos blockchain network",
          "type": "STRING"
        },
        {
          "name": "total_inflow",
          "description": "Cumulative value of inflows across the blockchain network",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow",
          "description": "Largest inflow amount during the measurement period",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "Transaction identifier of the top inflow transaction",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "Cumulative value of outflows across the blockchain network",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow",
          "description": "Largest outflow amount during the measurement period",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "Transaction identifier of the top outflow transaction",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when data was ingested into the system",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_liquidity_flow",
      "description": "This table provides an overview of the liquidity flow on the Osmosis blockchain, offering insights into the amount of assets flowing in and out of the network over time. It helps track the evolution of liquidity and the activity on the protocol.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "Timestamp elapsed since Osmosis liquidity flow events, measured in hours",
          "type": "TIMESTAMP"
        },
        {
          "name": "total_inflow",
          "description": "Cumulative value of incoming assets to Osmosis liquidity pool",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow",
          "description": "Single largest value of incoming assets to Osmosis liquidity pool",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "Transaction ID of top inflow event in Osmosis liquidity pool",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "Cumulative value of outgoing assets from Osmosis liquidity pool",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow",
          "description": "Single largest value of outgoing assets from Osmosis liquidity pool",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "Transaction ID of top outflow event in Osmosis liquidity pool",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when data was ingested into data processing system",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_new_users_ratio",
      "description": "This table tracks the growth and engagement of users in the Osmosis blockchain, providing insights into the adoption rate of the platform. By analyzing new and returning users, we can identify trends and patterns that can inform product development and marketing strategies.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "new_users",
          "description": "Number of unique new user addresses in the Osmosis network over time.",
          "type": "INTEGER"
        },
        {
          "name": "returning_users",
          "description": "Number of unique returning user addresses in the Osmosis network over time.",
          "type": "INTEGER"
        },
        {
          "name": "new_users_ratio",
          "description": "Ratio of new users to total users in the Osmosis network over time.",
          "type": "FLOAT"
        },
        {
          "name": "day",
          "description": "Timestamp in days, representing distinct time intervals for Osmosis network activity.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_osmo_price",
      "description": "This table contains historical price data for OSMOs (Osmosis tokens) fetched from the Cosmos ecosystem, providing a comprehensive snapshot of OSMO price movements. The data is useful for analysts and traders seeking to track OSMO market trends and patterns.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_minutes",
          "description": "Time elapsed since epoch in minutes, conveying temporal data within blockchain",
          "type": "TIMESTAMP"
        },
        {
          "name": "asset",
          "description": "ISO 4217 standard currency codes or symbols for digital assets within Cosmos ecosystem",
          "type": "STRING"
        },
        {
          "name": "price_in_usdc",
          "description": "Current value of assets in United States Dollars according to market rates",
          "type": "FLOAT"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp of when the data was ingested into the system from blockchain networks",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_osmo_top_stakeholders",
      "description": "This table showcases the top stakeholders in the Osmosis network, demonstrating their level of investment and commitment to the Cosmos ecosystem. The data highlights the key players in the Osmosis economy, providing insight into their staked resources.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "Date of the stake balance snapshot in UTC format",
          "type": "STRING"
        },
        {
          "name": "address",
          "description": "Public key or wallet address performing this stake action",
          "type": "STRING"
        },
        {
          "name": "staked_amount",
          "description": "Total amount of OSMO staked by this address at this date",
          "type": "FLOAT"
        },
        {
          "name": "bonded_amount",
          "description": "Amount of staked OSMO currently bonded for validation",
          "type": "FLOAT"
        },
        {
          "name": "liquid_amount",
          "description": "Amount of staked OSMO available for withdrawal as needed",
          "type": "FLOAT"
        }
      ]
    },
    {
      "name": "lenses_osmosis_returning_users_ratio",
      "description": "This table provides an overview of the ratio of new users who return to the Osmosis network over time. It helps to analyze user engagement and retention within the Cosmos ecosystem.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "new_users_ratio",
          "description": "Proportion of net new users in Osmosis ecosystem over a given time period.",
          "type": "FLOAT"
        },
        {
          "name": "day",
          "description": "Continuous date, representing the time scope for new_users_ratio calculation (UTC).",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_staking_flow",
      "description": "This table provides an overview of the staking flow across the Cosmos ecosystem, displaying key metrics responsible for the change in the token supply over time.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "Timestamp offset in hours since epoch, representing time elapsed in blockchain",
          "type": "TIMESTAMP"
        },
        {
          "name": "total_inflow",
          "description": "Cumulative inflow of Osmosis staking rewards over a given time period",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow",
          "description": "Largest Osmosis staking reward amount flowing into an address or validator",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "Transaction ID of the top inflow transaction",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "Cumulative outflow of Osmosis staking rewards from a validator or address",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow",
          "description": "Largest Osmosis staking reward amount flowing out of a validator or address",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "Transaction ID of the top outflow transaction",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp of data ingestion into the analytics system, in seconds since epoch",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_superfluid_staking_flow",
      "description": "This table provides a summary of the osmosis superfluid staking flow, offering insights into the amount of tokens flowing in and out of this staking mechanism within the cosmos ecosystem. It showcases the overall and top inflows and outflows of tokens, providing a comprehensive view of the staking dynamics.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "Elapsed time from epoch in hours",
          "type": "TIMESTAMP"
        },
        {
          "name": "total_inflow",
          "description": "Cumulative total incoming superfluid staking balance",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow",
          "description": "Largest single incoming superfluid staking balance",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "Transaction ID of top inflow superfluid staking balance",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "Cumulative total outgoing superfluid staking balance",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow",
          "description": "Largest single outgoing superfluid staking balance",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "Transaction ID of top outflow superfluid staking balance",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Time data was ingested into database in database-native format",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_trading_flow",
      "description": "This dataset provides trading volume and pool information for the Osmosis blockchain, offering insights into the liquidity and market activity within the Cosmos ecosystem.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "Elapsed time between transaction and current block in hours",
          "type": "TIMESTAMP"
        },
        {
          "name": "pool_id",
          "description": "Unique identifier for Osmosis liquidity pool",
          "type": "STRING"
        },
        {
          "name": "volume_in_usd",
          "description": "Total transaction volume in US dollars",
          "type": "FLOAT"
        },
        {
          "name": "tx_id",
          "description": "Transaction identifier for Osmosis cross-chain trading flow",
          "type": "STRING"
        },
        {
          "name": "max_volume_in_usd",
          "description": "Maximum single transaction volume in US dollars",
          "type": "FLOAT"
        }
      ]
    }
  ]
}