{
  "dataset": "lenses",
  "tables": [
    {
      "name": "lenses_cosmoshub_apr",
      "description": "This table provides an overview of the Average Annual Percentage Rate (APR) for various assets on the Cosmos network. The data is collected from blockchain sources within the Cosmos ecosystem.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "labels",
          "description": "Unique identifier for each asset in the Cosmos network.",
          "type": "TIMESTAMP"
        },
        {
          "name": "symbol",
          "description": "Symbol or abbreviation representing the asset.",
          "type": "STRING"
        },
        {
          "name": "mean_apr_1d_rolling",
          "description": "Mean Average Annual Percentage Rate for the asset over the past 1-day rolling period.",
          "type": "FLOAT"
        },
        {
          "name": "mean_apr_7d_rolling",
          "description": "Mean Average Annual Percentage Rate for the asset over the past 7-day rolling period.",
          "type": "FLOAT"
        },
        {
          "name": "mean_apr_30d_rolling",
          "description": "Mean Average Annual Percentage Rate for the asset over the past 30-day rolling period.",
          "type": "FLOAT"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_atom_price",
      "description": "This table provides the current prices of Atom and other Cosmos-ecosystem assets in USDC, sourced from blockchain data. It allows for tracking of price movements over time and enables data-driven decisions within the Cosmos ecosystem.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_minutes",
          "description": "Timestamp representing the time at which the asset price was observed, in minutes since the start of the Atom blockchain.",
          "type": "TIMESTAMP"
        },
        {
          "name": "asset",
          "description": "The name of the Cosmos-ecosystem asset being priced, such as 'Atom' or 'Osmosis'.",
          "type": "STRING"
        },
        {
          "name": "price_in_usdc",
          "description": "The current price of the asset in USDC, representing the amount of USDC required to purchase one unit of the asset.",
          "type": "FLOAT"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp representing the time at which the data was ingested into the database, in seconds since the Unix epoch.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_chain_daily_revenue",
      "description": "This table provides a daily summary of the revenue generated by transactions on the Cosmos Hub blockchain, offering insights into the ecosystem's growth and activity.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "Date in YYYY-MM-DD format representing the day for which the revenue data is recorded.",
          "type": "DATE"
        },
        {
          "name": "chain_id",
          "description": "Unique identifier for the Cosmos Hub blockchain, used to distinguish it from other chains in the ecosystem.",
          "type": "STRING"
        },
        {
          "name": "txn_fees",
          "description": "Total transaction fees collected on the Cosmos Hub blockchain for the given day.",
          "type": "FLOAT"
        },
        {
          "name": "lsd_fees",
          "description": "Total fees collected by the Liquidity Staking Derivative (LSD) on the Cosmos Hub blockchain for the given day.",
          "type": "FLOAT"
        },
        {
          "name": "ics_fees",
          "description": "Total fees collected by Inter-Chain Securities (ICS) on the Cosmos Hub blockchain for the given day.",
          "type": "FLOAT"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_chain_hourly_revenue",
      "description": "This table provides hourly revenue data for the Cosmos Hub blockchain, offering insights into the ecosystem's revenue streams. The data covers various fees generated through transactions and smart contracts.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "The date on which the revenue data was recorded, in UTC time.",
          "type": "DATE"
        },
        {
          "name": "chain_id",
          "description": "The identifier of the Cosmos Hub blockchain, representing the specific network on which the revenue was generated.",
          "type": "STRING"
        },
        {
          "name": "txn_fees",
          "description": "Transaction fees collected from users interacting with the Cosmos Hub blockchain, such as sending or receiving tokens.",
          "type": "FLOAT"
        },
        {
          "name": "lsd_fees",
          "description": "Fees collected from Ledger State Data (LSD) operations, which involve storing or retrieving data on the blockchain.",
          "type": "FLOAT"
        },
        {
          "name": "ics_fees",
          "description": "Fees collected from Inter-Chain Secret (ICS) operations, which enable secure and private communication between different blockchain networks.",
          "type": "FLOAT"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_ibc_flow",
      "description": "This table provides an overview of IBC flows on the Cosmos Hub network, offering insights into the transfer of assets between different chains within the ecosystem. The data is sourced from blockchain transactions.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "Timestamp of the blockchain transaction in ISO format.",
          "type": "TIMESTAMP"
        },
        {
          "name": "stride",
          "description": "Stride represents the number of blocks or a unit of time, indicating the frequency or rate at which transactions occur within the Cosmos ecosystem.",
          "type": "FLOAT"
        },
        {
          "name": "persistence",
          "description": "Persistence refers to the commitment of transactions to the blockchain, signifying the confirmation of IBC flows.",
          "type": "BIGNUMERIC"
        },
        {
          "name": "cosmoshub",
          "description": "Cosmos Hub is the primary network within the Cosmos ecosystem, serving as the central hub for IBC flows.",
          "type": "FLOAT"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when the data was ingested into the system, reflecting the last update time.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_liquid_staking",
      "description": "This table provides insights into the liquid staking performance on Cosmos Hub, showcasing the relationship between stride and persistence.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "Timestamp representing the date of the data point in YYYY-MM-DD format",
          "type": "TIMESTAMP"
        },
        {
          "name": "stride",
          "description": "Measure of the staking speed or the rate at which validators can accumulate new stakes",
          "type": "FLOAT"
        },
        {
          "name": "persistence",
          "description": "Indicates the percentage of existing stakes that remain active over time",
          "type": "BIGNUMERIC"
        },
        {
          "name": "cosmoshub",
          "description": "Represents the Cosmos Hub blockchain, where the liquid staking operation is taking place",
          "type": "FLOAT"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp representing the time when the data was ingested into the system",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_liquid_staking_flow",
      "description": "This table provides a snapshot of the liquid staking flow on the Cosmos Hub blockchain, offering insights into the inflow and outflow of assets. It helps users understand the dynamics of the staking ecosystem.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "Timestamp in hours from the start of the data, providing a temporal context for the staking flow.",
          "type": "TIMESTAMP"
        },
        {
          "name": "total_inflow",
          "description": "Total amount of assets flowing into the staking pool, measured in native Cosmos Hub tokens.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow",
          "description": "The largest single inflow of assets into the staking pool, enabling users to identify significant events.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "Transaction ID of the top inflow, allowing for further analysis or verification of the transaction.",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "Total amount of assets flowing out of the staking pool, measured in native Cosmos Hub tokens.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow",
          "description": "The largest single outflow of assets from the staking pool, facilitating the identification of notable events.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "Transaction ID of the top outflow, enabling users to investigate the transaction details.",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when the data was ingested into the system, ensuring data accuracy and freshness.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_staking_flow",
      "description": "This table tracks the staking flow of the Cosmos network, providing insights into the inflows and outflows of tokens across different accounts. It helps users understand the dynamics of the Cosmos ecosystem's token staking activities.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "Time in hours since the last block was added to the blockchain.",
          "type": "TIMESTAMP"
        },
        {
          "name": "total_inflow",
          "description": "Total amount of tokens inflowing into the staking pool at a given time.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow",
          "description": "The largest single inflow of tokens into the staking pool at a given time.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "Transaction ID of the transaction responsible for the top inflow.",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "Total amount of tokens outflowing from the staking pool at a given time.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow",
          "description": "The largest single outflow of tokens from the staking pool at a given time.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "Transaction ID of the transaction responsible for the top outflow.",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when the data was ingested into the system.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_bonded_liquidity_flow",
      "description": "This table provides insights into the flow of bonded liquidity in the Osmosis network, a decentralized exchange from the Cosmos ecosystem. It helps track the movement of assets and liquidity within the platform over time.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "The time period in hours for which the liquidity flow data is being measured.",
          "type": "TIMESTAMP"
        },
        {
          "name": "total_inflow",
          "description": "The total amount of liquidity flowing into the Osmosis network during the specified time period.",
          "type": "BIGNUMERIC"
        },
        {
          "name": "top_inflow",
          "description": "The largest amount of liquidity flowing into the Osmosis network during the specified time period.",
          "type": "BIGNUMERIC"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "The transaction ID associated with the top inflow of liquidity.",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "The total amount of liquidity flowing out of the Osmosis network during the specified time period.",
          "type": "BIGNUMERIC"
        },
        {
          "name": "top_outflow",
          "description": "The largest amount of liquidity flowing out of the Osmosis network during the specified time period.",
          "type": "BIGNUMERIC"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "The transaction ID associated with the top outflow of liquidity.",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "The timestamp when the data was ingested into the system.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_chain_hourly_revenue",
      "description": "The Osmosis Chain Hourly Revenue dataset provides insights into the revenue generated by the Osmosis blockchain on an hourly basis, including transaction fees, protocol revenue, and other revenue streams. This data can be used to analyze the financial performance of the Osmosis blockchain.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "The time of each data point in hours, representing the 1-hour intervals at which the revenue data is recorded.",
          "type": "TIMESTAMP"
        },
        {
          "name": "tx_fees",
          "description": "The total fees collected from transactions on the Osmosis blockchain within each 1-hour interval.",
          "type": "FLOAT"
        },
        {
          "name": "protorev",
          "description": "The revenue generated by the protocol from various sources, such as staking, delegation, and other protocol activities.",
          "type": "FLOAT"
        },
        {
          "name": "swap_fees",
          "description": "The fees collected from swap transactions on the Osmosis blockchain within each 1-hour interval.",
          "type": "FLOAT"
        },
        {
          "name": "taker_fees",
          "description": "The fees collected from taker transactions on the Osmosis blockchain within each 1-hour interval.",
          "type": "FLOAT"
        },
        {
          "name": "ingestion_timestamp",
          "description": "The timestamp at which the revenue data for each 1-hour interval was ingested into the dataset.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_concentration_of_activity",
      "description": "This dataset tracks the concentration of activity on the Osmosis network, a key metric for understanding the network's overall health and usage. It provides a daily snapshot of this key metric from the Cosmos ecosystem.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "day",
          "description": "The date in which the concentration of activity was recorded.",
          "type": "TIMESTAMP"
        },
        {
          "name": "COA",
          "description": "The concentration of activity on the Osmosis network for the given day, measured in a suitable unit of measurement.",
          "type": "FLOAT"
        }
      ]
    },
    {
      "name": "lenses_osmosis_daily_active_users",
      "description": "Daily active users on the Osmosis blockchain, providing insights into user engagement and activity. This data is collected from the Cosmos ecosystem blockchains.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "block_timestamp",
          "description": "The timestamp of the block in which the daily active user was detected, representing the time at which the user's activity was recorded.",
          "type": "TIMESTAMP"
        },
        {
          "name": "sender",
          "description": "The address of the user who performed a transaction or action on the Osmosis blockchain, identified as a daily active user.",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "The timestamp at which the data was ingested into the system, representing the time at which the data was made available for analysis.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_daily_active_users_count",
      "description": "This table provides a daily snapshot of active users in the Cosmos ecosystem, highlighting the growth and engagement of users within the network.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "day",
          "description": "Date of data collection in the format YYYY-MM-DD, representing the day for which the active user count is reported.",
          "type": "TIMESTAMP"
        },
        {
          "name": "unique_users",
          "description": "Total number of distinct wallet addresses that interacted with the Cosmos ecosystem on a given day.",
          "type": "INTEGER"
        }
      ]
    },
    {
      "name": "lenses_osmosis_ibc_flow",
      "description": "This table tracks IBC (Inter-Blockchain Communication) flows across the Cosmos ecosystem, providing insights into the movement of tokens and value between different chains.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "Time interval in hours that the IBC flow occurred.",
          "type": "TIMESTAMP"
        },
        {
          "name": "chain_id",
          "description": "Unique identifier of the Cosmos chain involved in the IBC flow.",
          "type": "STRING"
        },
        {
          "name": "total_inflow",
          "description": "Total amount of tokens or value flowing into the chain.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow",
          "description": "Maximum amount of tokens or value flowing into the chain.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "Transaction ID of the top inflow event.",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "Total amount of tokens or value flowing out of the chain.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow",
          "description": "Maximum amount of tokens or value flowing out of the chain.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "Transaction ID of the top outflow event.",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when the data was first ingested by the system.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_liquidity_flow",
      "description": "This table provides an overview of the liquidity flow within the Cosmos ecosystem. It offers insights into the total inflow and outflow of liquidity, as well as the top contributing transactions.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "The time in hours when the liquidity flow snapshot was taken.",
          "type": "TIMESTAMP"
        },
        {
          "name": "total_inflow",
          "description": "The total amount of liquidity that flowed into the network during the snapshot period.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow",
          "description": "The largest amount of liquidity that flowed into the network during the snapshot period.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "The ID of the transaction that contributed to the top inflow.",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "The total amount of liquidity that flowed out of the network during the snapshot period.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow",
          "description": "The largest amount of liquidity that flowed out of the network during the snapshot period.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "The ID of the transaction that contributed to the top outflow.",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "The timestamp when the liquidity flow data was ingested into the system.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_new_users_ratio",
      "description": "This table provides insights into the growth of Osmosis users over time, showcasing the number of new and returning users within the Cosmos ecosystem. By analyzing these metrics, network participants can gain a deeper understanding of user behavior and trends.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "new_users",
          "description": "The total number of new users who joined the Osmosis network within a given day.",
          "type": "INTEGER"
        },
        {
          "name": "returning_users",
          "description": "The total number of users who returned to the Osmosis network after a period of inactivity within a given day.",
          "type": "INTEGER"
        },
        {
          "name": "new_users_ratio",
          "description": "The percentage of new users compared to total users within a given day, representing the network's growth rate.",
          "type": "FLOAT"
        },
        {
          "name": "day",
          "description": "The date in which the user metrics were recorded, measured in days since the beginning of the dataset.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_osmo_price",
      "description": "This table provides real-time price data for OSMOSIS (OSMO) on the Cosmos blockchain ecosystem. It includes historical price records, allowing users to track the price movement of OSMO over time.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_minutes",
          "description": "The time in minutes since the OSMO price was last updated on the blockchain.",
          "type": "TIMESTAMP"
        },
        {
          "name": "asset",
          "description": "The asset (OSMO) for which the price data is recorded.",
          "type": "STRING"
        },
        {
          "name": "price_in_usdc",
          "description": "The current price of OSMO in USDC (US Dollar Coin).",
          "type": "FLOAT"
        },
        {
          "name": "ingestion_timestamp",
          "description": "The timestamp when the price data was ingested into the database.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_osmo_top_stakeholders",
      "description": "This table provides an overview of the top stakeholders in the Osmosis network, showcasing their staked, bonded, and liquid assets in the Cosmos ecosystem.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "Date of data snapshot, representing the point in time when the staking information was recorded.",
          "type": "STRING"
        },
        {
          "name": "address",
          "description": "Public wallet address of the top stakeholder, used to identify and track their staking activity.",
          "type": "STRING"
        },
        {
          "name": "staked_amount",
          "description": "Total amount of OSMO tokens staked by the top stakeholder, which are locked in the staking process to validate transactions on the network.",
          "type": "FLOAT"
        },
        {
          "name": "bonded_amount",
          "description": "Amount of OSMO tokens that have been bonded by the top stakeholder, used to secure their validator and participate in the network's validation process.",
          "type": "FLOAT"
        },
        {
          "name": "liquid_amount",
          "description": "Remaining amount of OSMO tokens that are not bonded or staked, which can be freely transferred or used for other purposes.",
          "type": "FLOAT"
        }
      ]
    },
    {
      "name": "lenses_osmosis_returning_users_ratio",
      "description": "This table provides insights into the growth rate of returning users in the cosmos ecosystem, offering valuable information for developers and researchers to understand user behavior within the network.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "new_users_ratio",
          "description": "The ratio of new users to the total number of users in a given day, providing a measure of user growth.",
          "type": "FLOAT"
        },
        {
          "name": "day",
          "description": "The day or block height when the user data was recorded, allowing for temporal analysis and tracking of changes over time.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_staking_flow",
      "description": "This table provides insights into the osmosis staking flow, offering a snapshot of the total inflow and outflow of assets, as well as the top contributors and transactions. The data is sourced from blockchains within the Cosmos ecosystem.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "The time elapsed in hours since the last ingestion of data.",
          "type": "TIMESTAMP"
        },
        {
          "name": "total_inflow",
          "description": "The total amount of assets flowing into the osmosis staking pool.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow",
          "description": "The largest amount of assets flowing into the osmosis staking pool.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "The transaction ID of the top inflow transaction.",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "The total amount of assets flowing out of the osmosis staking pool.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow",
          "description": "The largest amount of assets flowing out of the osmosis staking pool.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "The transaction ID of the top outflow transaction.",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "The timestamp of when the data was last ingested.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_superfluid_staking_flow",
      "description": "This table displays the superfluid staking flow for Osmosis, providing insights into the flow of tokens in and out of the network. It offers a snapshot of the network's liquidity and transaction activity.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "Time in hours since the start of the Osmosis blockchain.",
          "type": "TIMESTAMP"
        },
        {
          "name": "total_inflow",
          "description": "Total amount of tokens inflowing into the network during the specified time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow",
          "description": "The largest inflow of tokens into the network during the specified time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "Transaction ID of the top inflow transaction.",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "Total amount of tokens outflowing from the network during the specified time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow",
          "description": "The largest outflow of tokens from the network during the specified time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "Transaction ID of the top outflow transaction.",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when the data was ingested into the system.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_trading_flow",
      "description": "This table provides insights into Osmosis trading flow, showcasing the volume of trades and maximum volumes in USD across various pools. It offers a comprehensive view of the Osmosis DeFi ecosystem's trading activity.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "Time in hours since the block timestamp, allowing for analysis of trading activity over time",
          "type": "TIMESTAMP"
        },
        {
          "name": "pool_id",
          "description": "Unique identifier for each pool in the Osmosis ecosystem, facilitating the analysis of trading patterns across different pools",
          "type": "STRING"
        },
        {
          "name": "volume_in_usd",
          "description": "Total volume of trades in USD for each pool, providing a clear picture of trading activity in terms of USD value",
          "type": "FLOAT"
        },
        {
          "name": "tx_id",
          "description": "Unique identifier for each transaction, enabling the tracking of individual trades and their associated volumes",
          "type": "STRING"
        },
        {
          "name": "max_volume_in_usd",
          "description": "Maximum volume of trades in USD for each pool, highlighting the largest trades and their associated volumes in USD",
          "type": "FLOAT"
        }
      ]
    }
  ]
}