{
  "dataset": "lenses",
  "tables": [
    {
      "name": "lenses_cosmoshub_apr",
      "description": "This table provides a brief overview of the Average Annual Percentage Returns (APR) for various assets within the Cosmos Hub ecosystem. The data is sourced from blockchain transactions, offering insights into the performance of these assets over time.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "labels",
          "description": "The unique identifiers for the assets in the Cosmos Hub ecosystem.",
          "type": "TIMESTAMP"
        },
        {
          "name": "symbol",
          "description": "The abbreviated symbols for the assets in the Cosmos Hub ecosystem.",
          "type": "STRING"
        },
        {
          "name": "mean_apr_1d_rolling",
          "description": "The mean Average Annual Percentage Return (APR) for the past 1-day rolling period.",
          "type": "FLOAT"
        },
        {
          "name": "mean_apr_7d_rolling",
          "description": "The mean Average Annual Percentage Return (APR) for the past 7-day rolling period.",
          "type": "FLOAT"
        },
        {
          "name": "mean_apr_30d_rolling",
          "description": "The mean Average Annual Percentage Return (APR) for the past 30-day rolling period.",
          "type": "FLOAT"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_atom_price",
      "description": "Cosmos Hub Atom Price Data: This table contains historical prices of the native Cosmos (ATOM) cryptocurrency in USDC, sourced from various blockchains within the Cosmos ecosystem. The data provides insights into the price movements of ATOM over time.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_minutes",
          "description": "Timestamp in minutes representing the time at which the price was recorded.",
          "type": "TIMESTAMP"
        },
        {
          "name": "asset",
          "description": "The native Cosmos cryptocurrency (ATOM).",
          "type": "STRING"
        },
        {
          "name": "price_in_usdc",
          "description": "The price of ATOM in USDC at the given timestamp.",
          "type": "FLOAT"
        },
        {
          "name": "ingestion_timestamp",
          "description": "The timestamp when the data was ingested into the database.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_chain_daily_revenue",
      "description": "This table provides a daily breakdown of revenue generated by the Cosmos Hub blockchain and its associated chains. It includes transaction fees, liquidity staking derivatives (LSD) fees, and Inter-Chain Securities (ICS) fees.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "The date for which the revenue data is reported, in YYYY- MM-DD format.",
          "type": "DATE"
        },
        {
          "name": "chain_id",
          "description": "Unique identifier for each blockchain within the Cosmos ecosystem, used to distinguish between different chains.",
          "type": "STRING"
        },
        {
          "name": "txn_fees",
          "description": "Total transaction fees collected from all transactions on the blockchain, in the native cryptocurrency units (e.g., ATOM).",
          "type": "FLOAT"
        },
        {
          "name": "lsd_fees",
          "description": "Total liquidity staking derivatives fees collected from all LSD-related transactions on the blockchain, in the native cryptocurrency units (e.g., ATOM).",
          "type": "FLOAT"
        },
        {
          "name": "ics_fees",
          "description": "Total Inter-Chain Securities fees collected from all ICS-related transactions on the blockchain, in the native cryptocurrency units (e.g., ATOM).",
          "type": "FLOAT"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_chain_hourly_revenue",
      "description": "This dataset, cosmoshub_chain_hourly_revenue, captures hourly revenue generated from various Cosmos ecosystem blockchains. It provides a comprehensive view of the revenue streams from transaction fees and other sources.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "The date and time when the revenue was recorded in UTC timezone.",
          "type": "DATE"
        },
        {
          "name": "chain_id",
          "description": "The unique identifier of the Cosmos blockchain where the revenue was generated.",
          "type": "STRING"
        },
        {
          "name": "txn_fees",
          "description": "The total transaction fees collected from the blockchain in the specified hour.",
          "type": "FLOAT"
        },
        {
          "name": "lsd_fees",
          "description": "The total fees collected from Liquid Staking Derivatives (LSD) in the specified hour.",
          "type": "FLOAT"
        },
        {
          "name": "ics_fees",
          "description": "The total fees collected from Inter-Chain Securities (ICS) in the specified hour.",
          "type": "FLOAT"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_ibc_flow",
      "description": "This table provides an overview of IBC flows in the Cosmos ecosystem, offering insights into the transmission of assets and data between different blockchain networks. The data is sourced from various Cosmos blockchains, providing a comprehensive view of the network's activity.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "Date of the IBC flow in ISO 8601 format (YYYY-MM-DDTHH:MM:SSZ)",
          "type": "TIMESTAMP"
        },
        {
          "name": "stride",
          "description": "Stride ID of the IBC flow, uniquely identifying each transfer event",
          "type": "FLOAT"
        },
        {
          "name": "persistence",
          "description": "Persistence details of the IBC flow, including any relevant metadata",
          "type": "BIGNUMERIC"
        },
        {
          "name": "cosmoshub",
          "description": "Cosmos Hub address associated with the IBC flow, representing the source or destination network",
          "type": "FLOAT"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when the IBC flow data was ingested into the database, in ISO 8601 format (YYYY-MM- DDTHH:MM:SSZ)",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_liquid_staking",
      "description": "This table contains data related to liquid staking on the Cosmos Hub blockchain. It provides key metrics for understanding the performance and characteristics of staking on the network.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "The date when the data was observed or recorded, typically in a standard ISO 8601 format.",
          "type": "TIMESTAMP"
        },
        {
          "name": "stride",
          "description": "A measure of how well a validator is performing in terms of its effective staking power, taking into account network dynamics.",
          "type": "FLOAT"
        },
        {
          "name": "persistence",
          "description": "A measure of how well a validator is able to maintain its staking power over time, considering factors like downtime or slashing.",
          "type": "BIGNUMERIC"
        },
        {
          "name": "cosmoshub",
          "description": "The Cosmos Hub blockchain where the staking activity is occurring.",
          "type": "FLOAT"
        },
        {
          "name": "ingestion_timestamp",
          "description": "The timestamp when the data was ingested into the system, used for tracking data freshness and provenance.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_liquid_staking_flow",
      "description": "This table provides an overview of the inflows and outflows of liquidity in the Cosmos Hub ecosystem. It tracks the total and top inflows and outflows across the network, offering insights into the dynamics of liquid staking.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "Time interval in hours, representing the duration over which the inflow and outflow data is calculated.",
          "type": "TIMESTAMP"
        },
        {
          "name": "total_inflow",
          "description": "Total amount of liquidity inflow into the Cosmos Hub ecosystem within the specified time interval.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow",
          "description": "Highest amount of liquidity inflow into the Cosmos Hub ecosystem within the specified time interval.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "Transaction ID of the top inflow transaction within the specified time interval.",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "Total amount of liquidity outflow from the Cosmos Hub ecosystem within the specified time interval.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow",
          "description": "Highest amount of liquidity outflow from the Cosmos Hub ecosystem within the specified time interval.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "Transaction ID of the top outflow transaction within the specified time interval.",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when the data was ingested into the system, representing the freshness of the data.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_cosmoshub_staking_flow",
      "description": "This table tracks the staking flow on the Cosmos Hub, providing insights into the inflow and outflow of assets. It helps users understand the dynamics of the staking ecosystem on the Cosmos Network.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "Time in hours when the staking flow data was recorded.",
          "type": "TIMESTAMP"
        },
        {
          "name": "total_inflow",
          "description": "Total amount of assets that have flowed into the staking pool within the given time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow",
          "description": "The largest amount of assets that have flowed into the staking pool within the given time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "Transaction ID associated with the top inflow transaction.",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "Total amount of assets that have flowed out of the staking pool within the given time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow",
          "description": "The largest amount of assets that have flowed out of the staking pool within the given time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "Transaction ID associated with the top outflow transaction.",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when the staking flow data was ingested into the system.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_bonded_liquidity_flow",
      "description": "This table tracks the flow of bonded liquidity in the Osmosis network over time, providing insights into the dynamics of liquidity provision and usage within the ecosystem. The data is sourced from blockchain events across the Cosmos ecosystem.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "Time elapsed in hours since the beginning of the data collection period, serving as a timestamp for the liquidity flow data.",
          "type": "TIMESTAMP"
        },
        {
          "name": "total_inflow",
          "description": "Total amount of liquidity inflow into the Osmosis protocol over the specified time period.",
          "type": "BIGNUMERIC"
        },
        {
          "name": "top_inflow",
          "description": "Maximum amount of liquidity inflow into the Osmosis protocol over the specified time period.",
          "type": "BIGNUMERIC"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "Transaction ID of the transaction that corresponds to the maximum liquidity inflow into the Osmosis protocol.",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "Total amount of liquidity outflow from the Osmosis protocol over the specified time period.",
          "type": "BIGNUMERIC"
        },
        {
          "name": "top_outflow",
          "description": "Maximum amount of liquidity outflow from the Osmosis protocol over the specified time period.",
          "type": "BIGNUMERIC"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "Transaction ID of the transaction that corresponds to the maximum liquidity outflow from the Osmosis protocol.",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when the data was ingested into the system, used for tracking data freshness and processing status.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_chain_hourly_revenue",
      "description": "This table provides an hourly breakdown of revenue generated by the Osmosis network, offering insights into the blockchain's financial performance and growth. The data is aggregated from the Cosmos ecosystem, providing a comprehensive view of the network's revenue streams.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "The time in hours since the Osmosis network's inception, allowing for chronological analysis of revenue trends.",
          "type": "TIMESTAMP"
        },
        {
          "name": "tx_fees",
          "description": "Transaction fees collected by the Osmosis network for each hour, representing a significant revenue stream.",
          "type": "FLOAT"
        },
        {
          "name": "protorev",
          "description": "Protocol revenue generated by Osmosis, including rewards and other incentives for validators and users.",
          "type": "FLOAT"
        },
        {
          "name": "swap_fees",
          "description": "Fees earned by Osmosis for facilitating swaps between different assets on the network.",
          "type": "FLOAT"
        },
        {
          "name": "taker_fees",
          "description": "Taker fees collected by Osmosis for providing liquidity and facilitating trades on the network.",
          "type": "FLOAT"
        },
        {
          "name": "ingestion_timestamp",
          "description": "The timestamp when the data was ingested into the system, ensuring data freshness and accuracy.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_concentration_of_activity",
      "description": "This table tracks the concentration of Osmosis activity across various days, providing insights into the network's overall performance and user engagement within the Cosmos ecosystem.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "day",
          "description": "The day in which the Osmosis activity was recorded, representing a period of 24 hours.",
          "type": "TIMESTAMP"
        },
        {
          "name": "COA",
          "description": "The concentration of Osmosis activity, measuring the level of network engagement and user participation in the Cosmos ecosystem.",
          "type": "FLOAT"
        }
      ]
    },
    {
      "name": "lenses_osmosis_daily_active_users",
      "description": "This table provides an overview of daily active users across the Cosmos ecosystem, specifically focusing on Osmosis. It captures key information on user engagement and activity within the ecosystem.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "block_timestamp",
          "description": "Timestamp of the block when the user activity was recorded, representing a point in time on the blockchain.",
          "type": "TIMESTAMP"
        },
        {
          "name": "sender",
          "description": "Address of the sender or user who interacted with the blockchain, indicating user activity.",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when the user activity data was ingested into the database, representing the data's availability time.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_daily_active_users_count",
      "description": "Daily active users count in the Cosmos ecosystem, providing insights into the growth and adoption of blockchain-based services. This data is sourced from various blockchains within the ecosystem.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "day",
          "description": "Date representing the day for which the daily active user count is reported, in a standard ISO 8601 format.",
          "type": "TIMESTAMP"
        },
        {
          "name": "unique_users",
          "description": "Total count of unique users actively interacting with the Cosmos ecosystem on a given day.",
          "type": "INTEGER"
        }
      ]
    },
    {
      "name": "lenses_osmosis_ibc_flow",
      "description": "This table provides a snapshot of IBC (Inter-Blockchain Communication) flows on the Osmosis network. It captures key metrics such as inflows and outflows between chains in the Cosmos ecosystem.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "Time elapsed since the block was committed in hours.",
          "type": "TIMESTAMP"
        },
        {
          "name": "chain_id",
          "description": "Unique identifier for the blockchain network.",
          "type": "STRING"
        },
        {
          "name": "total_inflow",
          "description": "Total amount of tokens flowing into the Osmosis network.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow",
          "description": "Largest amount of tokens flowing into the Osmosis network.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "Transaction ID of the top inflow.",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "Total amount of tokens flowing out of the Osmosis network.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow",
          "description": "Largest amount of tokens flowing out of the Osmosis network.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "Transaction ID of the top outflow.",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when the data was ingested into the system.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_liquidity_flow",
      "description": "This table provides a detailed overview of liquidity flow in the Cosmos ecosystem, offering insights into the movement of assets across different blockchain networks. It helps users analyze the dynamics of liquidity and identify trends.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "Time in hours since the block was mined.",
          "type": "TIMESTAMP"
        },
        {
          "name": "total_inflow",
          "description": "Total amount of assets flowing into the network during the specified time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow",
          "description": "Largest amount of assets flowing into the network during the specified time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "Transaction ID of the transaction that contributed to the top inflow.",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "Total amount of assets flowing out of the network during the specified time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow",
          "description": "Largest amount of assets flowing out of the network during the specified time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "Transaction ID of the transaction that contributed to the top outflow.",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when the data was ingested into the system.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_new_users_ratio",
      "description": "This table provides insights into the growth of new users in the Osmosis blockchain ecosystem, showcasing the ratio of new users to the overall user base. By analyzing these metrics, one can gauge the effectiveness of onboarding processes and network adoption.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "new_users",
          "description": "The total number of new users added to the Osmosis blockchain network.",
          "type": "INTEGER"
        },
        {
          "name": "returning_users",
          "description": "The total number of users who have previously interacted with the Osmosis blockchain and have returned for another interaction.",
          "type": "INTEGER"
        },
        {
          "name": "new_users_ratio",
          "description": "The ratio of new users to the total number of users (new and returning) in the Osmosis blockchain network.",
          "type": "FLOAT"
        },
        {
          "name": "day",
          "description": "The date of the data point, indicating the specific period being measured.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_osmo_price",
      "description": "This table provides real-time data on the Osmosis (OSMO) cryptocurrency price in USDC, sourced from the Cosmos ecosystem blockchains. It offers a comprehensive view of the OSMO market performance.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_minutes",
          "description": "The time in minutes when the OSMO price was recorded.",
          "type": "TIMESTAMP"
        },
        {
          "name": "asset",
          "description": "The cryptocurrency asset being priced, in this case, Osmosis (OSMO).",
          "type": "STRING"
        },
        {
          "name": "price_in_usdc",
          "description": "The current price of OSMO in USDC at the time of recording.",
          "type": "FLOAT"
        },
        {
          "name": "ingestion_timestamp",
          "description": "The timestamp when the data was ingested into the system, potentially with a higher precision than the time_minutes field.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_osmo_top_stakeholders",
      "description": "This table provides an overview of the top stakeholders in the Osmosis network, offering insights into their staked, bonded, and liquid assets. The data is sourced from the Cosmos ecosystem, providing a comprehensive view of the network's key players.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "date",
          "description": "The date at which the stakeholder's asset distribution was recorded.",
          "type": "STRING"
        },
        {
          "name": "address",
          "description": "The blockchain address of the stakeholder.",
          "type": "STRING"
        },
        {
          "name": "staked_amount",
          "description": "The total amount of OSMO tokens staked by the address.",
          "type": "FLOAT"
        },
        {
          "name": "bonded_amount",
          "description": "The amount of OSMO tokens bonded by the address, which is used to secure the network.",
          "type": "FLOAT"
        },
        {
          "name": "liquid_amount",
          "description": "The amount of OSMO tokens available for use by the address, excluding bonded and staked amounts.",
          "type": "FLOAT"
        }
      ]
    },
    {
      "name": "lenses_osmosis_returning_users_ratio",
      "description": "This table tracks the ratio of new users in the Cosmos ecosystem over time, providing insights into the growth and adoption of blockchain services within the network. The data is derived from on-chain activity and offers a unique perspective on user engagement.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "new_users_ratio",
          "description": "The ratio of new users to the total number of users in the Cosmos ecosystem, indicating the rate of new user adoption.",
          "type": "FLOAT"
        },
        {
          "name": "day",
          "description": "The calendar day on which the new users ratio was recorded, formatted as YYYY-MM-DD.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_staking_flow",
      "description": "This table provides a high-level overview of the staking flow for Osmosis, a decentralized exchange and liquidity pool in the Cosmos ecosystem. It tracks the total staking inflow and outflow, as well as the top transactions contributing to these flows.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "Timestamp of the data point, represented as a time interval in hours.",
          "type": "TIMESTAMP"
        },
        {
          "name": "total_inflow",
          "description": "Total amount of tokens staked into Osmosis validators.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow",
          "description": "Maximum amount of tokens staked into a single Osmosis validator.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "Transaction ID of the top inflow transaction.",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "Total amount of tokens unstaked from Osmosis validators.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow",
          "description": "Maximum amount of tokens unstaked from a single Osmosis validator.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "Transaction ID of the top outflow transaction.",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "Timestamp when the data was ingested from the blockchain.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_superfluid_staking_flow",
      "description": "Superfluid staking flow data for the Osmosis network, providing insights into the hourly staking inflows and outflows.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "The time period in hours at which the staking inflows and outflows were recorded.",
          "type": "TIMESTAMP"
        },
        {
          "name": "total_inflow",
          "description": "The total amount of tokens staked into the Osmosis network during the specified time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow",
          "description": "The maximum amount of tokens staked into the Osmosis network during the specified time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_inflow_tx_id",
          "description": "The transaction ID corresponding to the maximum staking inflow during the specified time period.",
          "type": "STRING"
        },
        {
          "name": "total_outflow",
          "description": "The total amount of tokens unstaked from the Osmosis network during the specified time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow",
          "description": "The maximum amount of tokens unstaked from the Osmosis network during the specified time period.",
          "type": "FLOAT"
        },
        {
          "name": "top_outflow_tx_id",
          "description": "The transaction ID corresponding to the maximum staking outflow during the specified time period.",
          "type": "STRING"
        },
        {
          "name": "ingestion_timestamp",
          "description": "The timestamp when the data was ingested into the database.",
          "type": "TIMESTAMP"
        }
      ]
    },
    {
      "name": "lenses_osmosis_trading_flow",
      "description": "This table provides insights into the trading flow of the Osmosis ecosystem, offering a glimpse into the volumes and transactions that have taken place within its pools. By analyzing this data, users can gain a deeper understanding of the market dynamics and trends within the Osmosis network.",
      "tags": [
        "parsed_table"
      ],
      "columns": [
        {
          "name": "time_in_hours",
          "description": "The time in hours since the start of the Osmosis network, allowing for temporal analysis and trend identification.",
          "type": "TIMESTAMP"
        },
        {
          "name": "pool_id",
          "description": "A unique identifier for each pool within the Osmosis network, enabling users to track specific pools and their associated trading activity.",
          "type": "STRING"
        },
        {
          "name": "volume_in_usd",
          "description": "The total volume of transactions in USD for each pool, providing a measure of the overall trading activity within the network.",
          "type": "FLOAT"
        },
        {
          "name": "tx_id",
          "description": "A unique identifier for each transaction, allowing users to isolate and analyze individual trades within the Osmosis network.",
          "type": "STRING"
        },
        {
          "name": "max_volume_in_usd",
          "description": "The maximum volume of a single transaction in USD, offering insight into the largest trades that have taken place within the Osmosis network.",
          "type": "FLOAT"
        }
      ]
    }
  ]
}